def recipes(lang, food, servings):
    match lang:
        case "ru":
            match food:
                case 'kosher':
                    dictionary = {
                        'shakshuka': {
                            'title': 'Шакшука',
                            'ingredients': {
                                'Репчатый лук': {'quantity': 0.5, 'unit': 'головки'},
                                'Чеснок': {'quantity': 1, 'unit': 'зубчик'},
                                'Перец чили': {'quantity': 0.5, 'unit': 'штуки'},
                                'Оливковое масло': {'quantity': 1.5, 'unit': 'чайных ложек'},
                                'Орегано': 'щепотка',
                                'Кумин (зира)': 'щепотка',
                                'Измельченные помидоры в собственном соку': {'quantity': 100, 'unit': 'г'},
                                'Томатный сок': {'quantity': 1.5, 'unit': 'столовых ложек'},
                                'Куриное яйцо': {'quantity': 2, 'unit': 'штуки'},
                                'Кинза': 'по вкусу',
                                'Петрушка': {'quantity': 2, 'unit': 'г'},
                                'Сыр фета': {'quantity': 1, 'unit': 'чайная ложка'},
                                'Соль': 'по вкусу',
                                'Молотый черный перец': 'по вкусу',

                                '\n Калорийность': {'quantity': 277, 'unit': 'Ккал'}
                            },
                            'instructions': 'Мелко нарежьте лук, чеснок и острый перец чили. Обжарьте лук, чеснок и '
                                            'чили в оливковом масле. Добавьте щепотку орегано, немного кумина и '
                                            'обжарьте лук с чесноком и перцем. Теперь нужно влить банку '
                                            'консервированных томатов и обжарить их вместе с луком и фаршем, '
                                            'помешивая, около минуты. Добавьте воды или томатного соуса, чтобы соус '
                                            'получился достаточно жидким, и тушите еще минуту или две. Добавьте соль, '
                                            'молотый черный или белый перец и петрушку. Аккуратно разбейте яйца в '
                                            'соус, чтобы они не растекались, а лежали - каждое в своей ямке. Добавьте '
                                            'ломтики феты или другого мягкого солоноватого сыра. В конце необходимо '
                                            'посыпать яйца рубленой петрушкой и кинзой. И подавайте с лавашом или '
                                            'белым хлебом.'
                        },
                        'eggplant_salad_with_dill_and_garlic': {
                            'title': 'Салат из баклажанов с укропом и чесноком',
                            'ingredients': {
                                'Средний баклажан': {'quantity': 1, 'unit': 'штука'},
                                'Крупная соль': {'quantity': 1, 'unit': 'чайная ложка'},
                                'Оливковое масло': {'quantity': 3, 'unit': 'столовые ложки'},
                                'Красный болгарский перец': {'quantity': 1, 'unit': 'маленький'},
                                'Чеснок': {'quantity': 2, 'unit': 'зубчика'},
                                'Свежий укроп': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Красный винный уксус': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Сахар': {'quantity': 0.5, 'unit': 'чайной ложки'},

                                '\n Калорийность': {'quantity': 182, 'unit': 'Ккал'}
                            },
                            'instructions': 'Этот летний салат с баклажанами, укропом и чесноком — настоящая находка '
                                            'для тех, кто следит за своим питанием. Он приготовлен из простых '
                                            'ингредиентов, и даже новички справятся с его приготовлением. '
                                            'Ингредиенты: баклажан, красный болгарский перец, чеснок, свежий укроп, '
                                            'красный винный уксус, сахар, оливковое масло. Баклажаны режем кубиками, '
                                            'обжариваем, добавляем рубленый перец, чеснок, уксус, соль, '
                                            'перец и сахар. Мешаем, посыпаем свежим укропом. Готово!'
                        },
                        'broccoli_bake': {
                            'title': 'Запеканка с брокколи',
                            'ingredients': {
                                'Соцветия брокколи': {'quantity': 1, 'unit': 'стакан'},
                                'Яйцо': {'quantity': 1, 'unit': 'штука'},
                                'Тертый сыр Грюйер': {'quantity': 5, 'unit': 'г'},
                                'Сливочное масло': {'quantity': 5, 'unit': 'г'},
                                'Соль': 'по вкусу',

                                '\n Калорийность': {'quantity': 189, 'unit': 'Ккал'}
                            },
                            'instructions': 'Для тех, кто следит за здоровым питанием или придерживается '
                                            'вегетарианской диеты, брокколи – настоящая находка. Этот овощ богат '
                                            'витаминами, микро- и макроэлементами, а также пищевыми волокнами. С '
                                            'брокколи можно готовить много вкусных блюд, например, запеканку. Для '
                                            'этого вам понадобятся: брокколи, яйцо, тертый сыр Грюйер, '
                                            'сливочное масло и соль. Овощи отварите в подсоленной воде, '
                                            'затем выложите их в форму для запекания. Сверху налейте яйцо и посыпьте '
                                            'сыром, добавьте кусочки сливочного масла и поставьте в разогретую '
                                            'духовку на 20 минут.'
                        },
                        'chicken_cutlets_with_ptitim': {
                            'title': 'Котлеты с питимом',
                            'ingredients': {
                                'Курица': {'quantity': 180, 'unit': 'г'},
                                'Репчатый лук': {'quantity': 50, 'unit': 'г'},
                                'Белый хлеб': {'quantity': 60, 'unit': 'г'},
                                'Сливки 10%-ные': {'quantity': 100, 'unit': 'мл'},
                                'Укроп': {'quantity': 2.5, 'unit': 'г'},
                                'Сливочное масло': {'quantity': 10, 'unit': 'г'},
                                'Оливковое масло': {'quantity': 20, 'unit': 'мл'},
                                'Огурцы': {'quantity': 75, 'unit': 'г'},
                                'Птитим': {'quantity': 50, 'unit': 'г'},

                                '\nКалорийность': {'quantity': 305, 'unit': 'Ккал'}
                            },
                            'instructions': 'Богатый на белок и вкус, куриный фарш прекрасно сочетается с пшеничной '
                                            'кашей. Для приготовления вам понадобятся: куриное филе, репчатый лук, '
                                            'белый хлеб, сливки, укроп, сливочное и оливковое масло, огурцы и птитим. '
                                            'Отварите пшеничную кашу, обжарьте нарезанный лук и курицу, пропустите '
                                            'через мясорубку. Замешайте котлеты, обжарьте их до золотистой корочки. '
                                            'Подавайте с пшеничной кашей, добавьте нарезанные огурцы.'
                        },
                        'chicken_soup_with_corn_and_paprika': {
                            'title': 'Куриный суп с кукурузой и паприкой',
                            'ingredients': {
                                'Курица': {'quantity': 100, 'unit': 'г'},
                                'Сливочное масло': {'quantity': 10, 'unit': 'г'},
                                'Репчатый лук': {'quantity': 20, 'unit': 'г'},
                                'Пшеничная мука': {'quantity': 15, 'unit': 'г'},
                                'Куриный бульон': {'quantity': 500, 'unit': 'мл'},
                                'Консервированная кукуруза': {'quantity': 50, 'unit': 'г'},
                                'Паприка': {'quantity': 0.25, 'unit': 'чайной ложки'},
                                'Концентрированное молоко': {'quantity': 100, 'unit': 'мл'},
                                'Херес': {'quantity': 10, 'unit': 'мл'},

                                '\nКалорийность': {'quantity': 360, 'unit': 'Ккал'}
                            },
                            'instructions': 'Вариант супа, который поднимает настроение! Сварите курицу в бульоне, '
                                            'обжарьте лук и муку, затем влейте бульон и добавьте молоко, кукурузу и '
                                            'паприку. Варите суп, пока не сварится курица, затем влейте херес.'
                        }
                    }

                    for recipe_data in dictionary.values():
                        for ingredient_data in recipe_data['ingredients'].values():
                            if 'quantity_per_serving' in ingredient_data:
                                ingredient_data['quantity'] = ingredient_data['quantity_per_serving'] * servings

                    return dictionary

                case 'vegan':
                    dictionary = {
                        'pasta_with_mushrooms': {
                            'title': 'Паста с грибами',
                            'ingredients': {
                                'Паста': {'quantity': 75, 'unit': 'гр'},
                                'Грибы': {'quantity': 50, 'unit': 'гр'},
                                'Помидоры черри': {'quantity': 38, 'unit': 'гр'},
                                'Молоко кокосовое': {'quantity': 63, 'unit': 'мл'},
                                'Шпинат': {'quantity': 13, 'unit': 'гр'},
                                'Чеснок': {'quantity': 0.3, 'unit': 'зубчика'},
                                'Соевый соус': {'quantity': 7.5, 'unit': 'мл'},
                                'Масло оливковое': {'quantity': 5, 'unit': 'мл'},
                                'Соль': 'по вкусу',
                                'Перец черный': 'по вкусу молотый',
                                'Зелень': 'по вкусу',

                                '\nКалорийность': {'quantity': 414, 'unit': 'Ккал'}
                            },
                            'instructions': 'Нарезать все ингредиенты. Вскипятить воду, подсолить. Отварить пасту до '
                                            'состояния аль денте. Поставить сковороду на умеренный огонь, '
                                            'влить растительное масло, разогреть. Обжарить грибы 3-4 минуты, '
                                            'помешивая. Добавить шпинат и чеснок в сковороду к грибам. Перемешать и '
                                            'всё вместе обжаривать еще 2 минуты. В сковороду добавить помидоры черри. '
                                            'Перемешать. Жарить еще пару минут. Влить соевый соус. Добавить '
                                            'предварительно отваренную пасту. Хорошо перемешать содержимое '
                                            'сковороды. Влить кокосовое молоко. Тщательно перемешать. Дать покипеть 3 '
                                            'минуты на минимальном огне.'
                        },
                        'lintil_cutlets': {
                            'title': 'Котлеты из чечевицы',
                            'ingredients': {
                                'Чечевица': {'quantity': 30, 'unit': 'г красная'},
                                'Лук репчатый': {'quantity': 30, 'unit': 'г'},
                                'Морковь': {'quantity': 23, 'unit': 'г'},
                                'Мука': {'quantity': 6, 'unit': 'г'},
                                'Хмели-сунели': {'quantity': 0.2, 'unit': 'г'},
                                'Чеснок': {'quantity': 0.4, 'unit': 'г сушеный'},
                                'Орехи грецкие': {'quantity': 10, 'unit': 'г'},
                                'Зелень': {'quantity': 4, 'unit': 'г'},
                                'Масло растительное': {'quantity': 6, 'unit': 'мл'},
                                'Соль': 'по вкусу',
                                'Перец черный': 'по вкусу молотый',
                                'Вода': {'quantity': 40, 'unit': 'мл'},

                                '\nКалорийность': {'quantity': 265, 'unit': 'Ккал'}
                            },
                            'instructions': 'Луковицу очистить от шелухи. Нарезать небольшими кусочками. Обжарить '
                                            'лук на растительном масле 2-3 минуты на среднем огне, постоянно '
                                            'помешивая, чтобы все луковые кусочки равномерно обжарились. Морковь '
                                            'очистить от кожуры и натереть на терке. Жарить на среднем огне еще 2-3 '
                                            'минуты, помешивая. Красную чечевицу несколько раз промыть проточной '
                                            'водой, перетирая зерна между пальцами, чтобы удалить всю пыль. Добавить '
                                            'в сковороду. Всыпать соль, черный молотый перец, хмели-сунели, '
                                            'сушеный молотый чеснок. Все ингредиенты перемешать. Влить воду и '
                                            'довести до кипения. накрыть крышкой и на минимальном огне довести '
                                            'чечевицу до готовности. Остудить и измельчить блендером. Добавьте '
                                            'муку и пермешайте. Измельчите грецкие орехи и добавьте к общей массе, '
                                            'добавьте зелень. Сформируйте котлеты и обжарьте на растительном масле.'
                        },
                        'ratatouille': {
                            'title': 'Рататуй',
                            'ingredients': {
                                'Баклажаны': {'quantity': 0.5, 'unit': 'штуки'},
                                'Желтый сладкий перец': {'quantity': 0.5, 'unit': 'штуки'},
                                'Красный сладкий перец': {'quantity': 0.5, 'unit': 'штуки'},
                                'Репчатый лук': {'quantity': 0.5, 'unit': 'головки'},
                                'Чеснок': {'quantity': 0.5, 'unit': 'зубчика'},
                                'Помидоры': {'quantity': 0.5, 'unit': 'штуки'},
                                'Сахар': 'щепотка',
                                'Оливковое масло': {'quantity': 1.5, 'unit': 'чайных ложек'},
                                'Томатная паста': 'по вкусу',
                                'Петрушка': {'quantity': 2, 'unit': 'г'},
                                'Соль': 'по вкусу',
                                'Молотый черный перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 138, 'unit': 'Ккал'}
                            },
                            'instructions': 'Нарезать мелкими кубиками лук и баклажаны. Баклажаны посыпать солью и '
                                            'дать им полежать несколько минут. За это время очистить перцы и '
                                            'помидоры от внутренностей, а мякоть нарезать такими же мелкими кубиками, '
                                            'как до того баклажаны и лук. Чеснок и петрушку мелко нарубить. Разогреть '
                                            'в сковородке часть оливкового масла, обжарить до мягкости лук и '
                                            'откинуть его на дуршлаг. Добавить в сковороду немного масла, обжарить на '
                                            'нем до мягкости предварительно отжатые от лишней жидкости кубики '
                                            'баклажанов. Обжаренные баклажаны откинуть на дуршлаг. Теперь осталось '
                                            'обжарить все на том же масле кубики перца и тоже откинуть их на дуршлаг. '
                                            'Долить в сковороду оставшееся масло, обжарить чеснок до мягкости, тут же '
                                            'добавить томатную пасту и щепотку сахара, а потом сразу помидоры. Тушить '
                                            'тридцать секунд, после чего вмешать все ранее обжаренные овощи и '
                                            'рубленую петрушку, посолить, поперчить, потомить минуту — и снять с огня.'
                        },
                        'pasta_with_fresh_tomatoes': {
                            'title': 'Паста со свежими помидрами',
                            'ingredients': {
                                'Паста тальятелле': {'quantity': 100, 'unit': 'г'},
                                'Помидоры': {'quantity': 0.5, 'unit': 'штуки'},
                                'Маслины без косточек': {'quantity': 2.5, 'unit': 'штуки'},
                                'Чеснок': {'quantity': 1, 'unit': 'зубчик'},
                                'Оливковое масло': {'quantity': 1.5, 'unit': 'столовых ложек'},

                                '\nКалорийность': {'quantity': 532, 'unit': 'Ккал'}
                            },
                            'instructions': 'В подсоленной кипящей воде отварить пасту. Параллельно в 1 столовой '
                                            'ложке оливкового масла слегка обжарить чеснок и нарезанные кружочками '
                                            'маслины. Свежие помидоры нарезать кубиками и добавить к чесноку и '
                                            'маслинам. Готовить помидоры не нужно, они должны только прогреться. '
                                            'Соус слегка посолить и поперчить. Слить воду и соединить пасту с соусом. '
                                            'Выложить пасту в тарелку и слегка полить оливковым маслом.'
                        }
                    }

                    for recipe_data in dictionary.values():
                        for ingredient_data in recipe_data['ingredients'].values():
                            if 'quantity_per_serving' in ingredient_data:
                                ingredient_data['quantity'] = ingredient_data['quantity_per_serving'] * servings

                    return dictionary
                case 'halal':
                    dictionary = {
                        'chicken_skewers_with_vegetables': {
                            'title': 'Куриный шашлык с овощами',
                            'ingredients': {
                                'Куриное филе': {'quantity': 150, 'unit': 'г'},
                                'Болгарский перец': {'quantity': 100, 'unit': 'г'},
                                'Помидоры черри': {'quantity': 100, 'unit': 'г'},
                                'Оливковое масло': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Сушеный тимьян': {'quantity': 1, 'unit': 'чайная ложка'},
                                'Соль': 'по вкусу',
                                'Перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 111, 'unit': 'Ккал'}
                            },
                            'instructions': 'Нарежьте куриное филе и овощи на небольшие кусочки. Смешайте куриное '
                                            'мясо, овощи, оливковое масло, тимьян, соль и перец. Нанижите ингредиенты '
                                            'на шпажки и обжарьте на гриле или сковороде-гриль до готовности, '
                                            'около 15-20 минут.'
                        },
                        'fried_fish_with_vegetables': {
                            'title': 'Жареная рыба с овощами',
                            'ingredients': {
                                'Белая рыба (треска, пикша или хек)': {'quantity': 150, 'unit': 'г'},
                                'Брокколи': {'quantity': 100, 'unit': 'г'},
                                'Морковь': {'quantity': 50, 'unit': 'г'},
                                'Оливковое масло': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Лимонный сок': {'quantity': 1, 'unit': 'чайная ложка'},
                                'Соль': 'по вкусу',
                                'Перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 93, 'unit': 'Ккал'}
                            },
                            'instructions': 'Нарежьте рыбу на порционные куски. Разогрейте оливковое масло на '
                                            'сковороде и обжарьте рыбу с обеих сторон до золотистой корочки, '
                                            'около 5-7 минут. Добавьте нарезанные брокколи и морковь, готовьте еще '
                                            '5-7 минут до мягкости овощей. Сбрызните блюдо лимонным соком, '
                                            'посолите и поперчите по вкусу.'
                        },
                        'chicken_with_rice_and_vegetables': {
                            'title': 'Курица с рисом и овощами',
                            'ingredients': {
                                'Куриная грудка': {'quantity': 150, 'unit': 'г'},
                                'Рис': {'quantity': 100, 'unit': 'г'},
                                'Брокколи': {'quantity': 50, 'unit': 'г'},
                                'Морковь': {'quantity': 50, 'unit': 'г'},
                                'Оливковое масло': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Соль': 'по вкусу',
                                'Перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 118, 'unit': 'Ккал'}
                            },
                            'instructions': 'Отварите рис согласно инструкции на упаковке. Нарежьте курицу на '
                                            'небольшие кусочки. Обжарьте курицу на оливковом масле до золотистой '
                                            'корочки, около 7-10 минут. Добавьте нарезанные брокколи и морковь, '
                                            'готовьте еще 5-7 минут до мягкости овощей. Соедините курицу с рисом, '
                                            'посолите и поперчите по вкусу.'
                        },
                        'basbousa': {
                            'title': 'Басбуса (сладкий пирог)',
                            'ingredients': {
                                'Манная крупа': {'quantity': 50, 'unit': 'г'},
                                'Кокосовая стружка': {'quantity': 10, 'unit': 'г'},
                                'Мука': {'quantity': 20, 'unit': 'г'},
                                'Сахар': {'quantity': 15, 'unit': 'г'},
                                'Разрыхлитель': {'quantity': 0.5, 'unit': 'чайной ложки'},
                                'Йогурт': {'quantity': 50, 'unit': 'г'},
                                'Растительное масло': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Яйцо': {'quantity': 1, 'unit': 'штука'},
                                'Сахар(для сиропа)': {'quantity': 2, 'unit': 'г'},
                                'Вода': {'quantity': 2, 'unit': 'столовые ложки'},
                                'Лимонный сок': {'quantity': 1, 'unit': 'чайная ложка'},
                                'Ванилин': 'щепотка',

                                '\nКалорийность': {'quantity': 232, 'unit': 'Ккал'}
                            },
                            'instructions': 'Смешайте сухие ингредиенты, затем добавьте йогурт, масло и яйцо, '
                                            'замесите тесто. Выпекайте пирог 20-25 минут, затем пропитайте его сиропом.'
                        },
                        'maqlooba': {
                            'title': 'Маклюба (Макбус)',
                            'ingredients': {
                                'Баранина или курица': {'quantity': 150, 'unit': 'г'},
                                'Рис': {'quantity': 100, 'unit': 'г'},
                                'Луковица': {'quantity': 1, 'unit': 'средняя'},
                                'Помидоры': {'quantity': 2, 'unit': 'средних'},
                                'Баклажан': {'quantity': 1, 'unit': 'средний'},
                                'Растительное масло': {'quantity': 2, 'unit': 'столовые ложки'},
                                'Смесь специй для маклюбы (кумин, корица, черный перец)': {'quantity': 1,
                                                                                           'unit': 'чайная ложка'},
                                'Соль': 'по вкусу',

                                '\nКалорийность': {'quantity': 146, 'unit': 'Ккал'}
                            },
                            'instructions': 'Разогрейте растительное масло в глубокой сковороде или казане. Обжарьте '
                                            'мясо до золотистой корочки, затем добавьте лук и обжарьте до '
                                            'прозрачности. Добавьте помидоры, баклажаны, специи и соль. Перемешайте и '
                                            'тушите 5-7 минут. Добавьте рис, перемешайте и готовьте еще 5 минут. '
                                            'Накройте сковороду крышкой и тушите на медленном огне 20-25 минут до '
                                            'готовности риса. Переверните маклюбу на блюдо и подавайте.'
                        }
                    }

                    for recipe_data in dictionary.values():
                        for ingredient_data in recipe_data['ingredients'].values():
                            if 'quantity_per_serving' in ingredient_data:
                                ingredient_data['quantity'] = ingredient_data['quantity_per_serving'] * servings

                    return dictionary

                case 'regular':
                    dictionary = {
                        'chicken_with_rice_and_vegetables': {
                            'title': 'Куриная грудка с рисом и овощами',
                            'ingredients': {
                                'Куриная грудка': {'quantity': 150, 'unit': 'г'},
                                'Рис': {'quantity': 100, 'unit': 'г'},
                                'Брокколи': {'quantity': 50, 'unit': 'г'},
                                'Морковь': {'quantity': 50, 'unit': 'г'},
                                'Оливковое масло': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Соль': 'по вкусу',
                                'Перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 433, 'unit': 'Ккал'}
                            },
                            'instructions': 'Отварите рис согласно инструкции на упаковке. Нарежьте курицу на '
                                            'небольшие кусочки. Обжарьте курицу на оливковом масле до золотистой '
                                            'корочки, около 7-10 минут. Добавьте нарезанные брокколи и морковь, '
                                            'готовьте еще 5-7 минут до мягкости овощей. Соедините курицу с рисом, '
                                            'посолите и поперчите по вкусу.'
                        },
                        'spaghetti_with_meatballs': {
                            'title': 'Спагетти с фрикадельками',
                            'ingredients': {
                                'Спагетти': {'quantity': 100, 'unit': 'г'},
                                'Фарш (говядина/свинина)': {'quantity': 80, 'unit': 'г'},
                                'Яйцо': {'quantity': 1, 'unit': 'штука'},
                                'Панировочные сухари': {'quantity': 2, 'unit': 'столовые ложки'},
                                'Тертый пармезан': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Оливковое масло': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Чеснок': {'quantity': 1, 'unit': 'зубчик'},
                                'Томатный соус': {'quantity': 400, 'unit': 'г'},
                                'Соль': 'по вкусу',
                                'Перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 450, 'unit': 'Ккал'}
                            },
                            'instructions': 'Сварите спагетти по инструкции на упаковке. Смешайте фарш, яйцо, '
                                            'панировочные сухари, пармезан, соль и перец. Сформируйте небольшие '
                                            'фрикадельки. Обжарьте фрикадельки на оливковом масле до золотистой '
                                            'корочки. Добавьте измельченный чеснок и томатный соус, тушите 10-15 '
                                            'минут. Подавайте спагетти с фрикадельками и соусом.'
                        },
                        'lasagna': {
                            'title': 'Лазанья',
                            'ingredients': {
                                'Листы лазаньи': {'quantity': 100, 'unit': 'г'},
                                'Фарш (говядина/свинина)': {'quantity': 100, 'unit': 'г'},
                                'Оливковое масло': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Луковица': {'quantity': 1, 'unit': 'штука'},
                                'Чеснок': {'quantity': 2, 'unit': 'зубчика'},
                                'Томатный соус': {'quantity': 400, 'unit': 'г'},
                                'Сыр моцарелла': {'quantity': 100, 'unit': 'г'},
                                'Тертый пармезан': {'quantity': 30, 'unit': 'г'},
                                'Соль': 'по вкусу',
                                'Перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 550, 'unit': 'Ккал'}
                            },
                            'instructions': 'Обжарьте фарш на оливковом масле до готовности, добавьте нарезанный лук '
                                            'и чеснок. Добавьте томатный соус, соль и перец, тушите 10-15 минут. '
                                            'Выложите в форму слой листов лазаньи, затем слой фарша с соусом, '
                                            'посыпьте моцареллой и пармезаном. Повторите слои, накрыв последним слоем '
                                            'листов лазаньи. Запекайте в духовке при 180°C 30-40 минут.'
                        },
                        'baked_fish_with_potatoes': {
                            'title': 'Запеченная рыба с картофелем',
                            'ingredients': {
                                'Белая рыба (треска, пикша или хек)': {'quantity': 150, 'unit': 'г'},
                                'Картофель': {'quantity': 200, 'unit': 'г'},
                                'Оливковое масло': {'quantity': 1, 'unit': 'столовая ложка'},
                                'Лимонный сок': {'quantity': 1, 'unit': 'чайная ложка'},
                                'Измельченный укроп': {'quantity': 1, 'unit': 'чайная ложка'},
                                'Соль': 'по вкусу',
                                'Перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 210, 'unit': 'Ккал'}
                            },
                            'instructions': 'Нарежьте картофель ломтиками и выложите на противень, смазанный маслом. '
                                            'Сверху выложите рыбу, сбрызните лимонным соком, посыпьте укропом, '
                                            'солью и перцем. Запекайте в духовке при 200°C 20-25 минут до готовности.'
                        },
                        'chicken_noodle_soup': {
                            'title': 'Куриный суп с лапшой',
                            'ingredients': {
                                'Куриный бульон': {'quantity': 200, 'unit': 'мл'},
                                'Лапша': {'quantity': 50, 'unit': 'г'},
                                'Куриная грудка': {'quantity': 50, 'unit': 'г'},
                                'Морковь': {'quantity': 50, 'unit': 'г'},
                                'Лук-порей': {'quantity': 50, 'unit': 'г'},
                                'Зеленый лук': {'quantity': 1, 'unit': 'стебель'},
                                'Соль': 'по вкусу',
                                'Перец': 'по вкусу',

                                '\nКалорийность': {'quantity': 150, 'unit': 'Ккал'}
                            },
                            'instructions': 'Доведите куриный бульон до кипения, добавьте лапшу и варите 5-7 минут. '
                                            'Добавьте нарезанную курицу, морковь и лук-порей, варите еще 5-7 минут. '
                                            'Посолите и поперчите по вкусу, добавьте зеленый лук.'
                        }
                    }

                    for recipe_data in dictionary.values():
                        for ingredient_data in recipe_data['ingredients'].values():
                            if 'quantity_per_serving' in ingredient_data:
                                ingredient_data['quantity'] = ingredient_data['quantity_per_serving'] * servings

                    return dictionary

        case "en":
            match food:
                case 'kosher':
                    dictionary = {
                        'shakshuka': {
                            'title': 'Shakshuka',
                            'ingredients': {
                                'Onion': {'quantity': 0.5, 'unit': 'head'},
                                'Garlic': {'quantity': 1, 'unit': 'clove'},
                                'Chili pepper': {'quantity': 0.5, 'unit': 'piece'},
                                'Olive oil': {'quantity': 1.5, 'unit': 'teaspoons'},
                                'Oregano': 'pinch',
                                'Cumin (zira)': 'pinch',
                                'Chopped tomatoes in their own juice': {'quantity': 100, 'unit': 'g'},
                                'Tomato juice': {'quantity': 1.5, 'unit': 'tablespoons'},
                                'Chicken egg': {'quantity': 2, 'unit': 'pieces'},
                                'Cilantro': 'as desired',
                                'Parsley': {'quantity': 2, 'unit': 'g'},
                                'Feta cheese': {'quantity': 1, 'unit': 'teaspoon'},
                                'Salt': 'as desired',
                                'Ground black pepper': 'as desired',

                                '\nCalories': {'quantity': 277, 'unit': 'kcal'}
                            },
                            'instructions': 'Featuring finely chopped onion, garlic, and chili pepper, this dish is a '
                                            'savory treat. Start by sautéing these aromatics in olive oil. Add '
                                            'oregano, a dash of cumin, and then stir in the pureed canned tomatoes. '
                                            'Simmer until everything melds, then create wells for the eggs. Crack '
                                            'them in, add crumbled feta, and let them poach gently in the sauce. '
                                            'Sprinkle with fresh cilantro and parsley before serving.'
                        },
                        'eggplant_salad_with_dill_and_garlic': {
                            'title': 'Eggplant Salad with Dill and Garlic',
                            'ingredients': {
                                'Medium eggplant': {'quantity': 1, 'unit': 'piece'},
                                'Coarse salt': {'quantity': 1, 'unit': 'teaspoon'},
                                'Olive oil': {'quantity': 3, 'unit': 'tablespoons'},
                                'Red bell pepper': {'quantity': 1, 'unit': 'small'},
                                'Garlic': {'quantity': 2, 'unit': 'cloves'},
                                'Fresh dill': {'quantity': 1, 'unit': 'tablespoon'},
                                'Red wine vinegar': {'quantity': 1, 'unit': 'tablespoon'},
                                'Sugar': {'quantity': 0.5, 'unit': 'teaspoon'},

                                '\nCalories': {'quantity': 182, 'unit': 'kcal'}
                            },
                            'instructions': 'This summer salad with eggplants, dill, and garlic is a real find for '
                                            'those who watch their diet. It is made from simple ingredients, '
                                            'and even novices will be able to prepare it. Ingredients: eggplant, '
                                            'red bell pepper, garlic, fresh dill, red wine vinegar, sugar, '
                                            'olive oil. Cut the eggplants into cubes, fry them, add chopped pepper, '
                                            'garlic, vinegar, salt, pepper, and sugar. Stir, sprinkle with fresh '
                                            'dill. Done!'
                        },
                        'broccoli_bake': {
                            'title': 'Broccoli Bake',
                            'ingredients': {
                                'Broccoli florets': {'quantity': 1, 'unit': 'cup'},
                                'Egg': {'quantity': 1, 'unit': 'piece'},
                                'Grated Gruyère cheese': {'quantity': 5, 'unit': 'g'},
                                'Butter': {'quantity': 5, 'unit': 'g'},
                                'Salt': 'as desired',

                                '\nCalories': {'quantity': 189, 'unit': 'kcal'}
                            },
                            'instructions': 'For those who follow a healthy diet or adhere to a vegetarian diet, '
                                            'broccoli is a real find. This vegetable is rich in vitamins, micro- and '
                                            'macroelements, as well as dietary fiber. You can cook many delicious '
                                            'dishes with broccoli, for example, a casserole. For this you will need: '
                                            'broccoli, egg, grated Gruyère cheese, butter, and salt. Boil the '
                                            'vegetables in salted water, then place them in a baking dish. Pour the '
                                            'egg on top and sprinkle with cheese, add pieces of butter and place in a '
                                            'preheated oven for 20 minutes.'
                        },
                        'chicken_cutlets_with_ptitim': {
                            'title': 'Chicken Cutlets with Ptitim',
                            'ingredients': {
                                'Chicken': {'quantity': 180, 'unit': 'g'},
                                'Onion': {'quantity': 50, 'unit': 'g'},
                                'White bread': {'quantity': 60, 'unit': 'g'},
                                'Heavy cream (10%)': {'quantity': 100, 'unit': 'ml'},
                                'Dill': {'quantity': 2.5, 'unit': 'g'},
                                'Butter': {'quantity': 10, 'unit': 'g'},
                                'Olive oil': {'quantity': 20, 'unit': 'ml'},
                                'Cucumbers': {'quantity': 75, 'unit': 'g'},
                                'Ptitim': {'quantity': 50, 'unit': 'g'},

                                '\nCalories': {'quantity': 305, 'unit': 'kcal'}
                            },
                            'instructions': 'Rich in protein and flavor, chicken minced meat goes perfectly with '
                                            'wheat cereal. To prepare, you will need: chicken fillet, onion, '
                                            'white bread, heavy cream, dill, butter, olive oil, cucumbers, '
                                            'and ptitim. Cook the wheat cereal, fry the sliced onion and chicken, '
                                            'pass through a meat grinder. Make cutlets, fry them until golden brown. '
                                            'Serve with wheat cereal, add sliced cucumbers.'
                        },
                        'chicken_soup_with_corn_and_paprika': {
                            'title': 'Chicken Soup with Corn and Paprika',
                            'ingredients': {
                                'Chicken': {'quantity': 100, 'unit': 'g'},
                                'Butter': {'quantity': 10, 'unit': 'g'},
                                'Onion': {'quantity': 20, 'unit': 'g'},
                                'Flour': {'quantity': 15, 'unit': 'g'},
                                'Chicken broth': {'quantity': 500, 'unit': 'ml'},
                                'Canned corn': {'quantity': 50, 'unit': 'g'},
                                'Paprika': {'quantity': 0.25, 'unit': 'teaspoon'},
                                'Condensed milk': {'quantity': 100, 'unit': 'ml'},
                                'Sherry': {'quantity': 10, 'unit': 'ml'},

                                '\nCalories': {'quantity': 360, 'unit': 'kcal'}
                            },
                            'instructions': 'This soup variant is mood-lifting! Cook chicken in broth, sauté onion '
                                            'and flour, then pour in broth and add milk, corn, and paprika. Simmer '
                                            'until chicken is cooked, then add sherry.'
                        }
                    }

                    for recipe_data in dictionary.values():
                        for ingredient_data in recipe_data['ingredients'].values():
                            if 'quantity_per_serving' in ingredient_data:
                                ingredient_data['quantity'] = ingredient_data['quantity_per_serving'] * servings

                    return dictionary

                case 'vegan':
                    dictionary = {
                        'pasta_with_mushrooms': {
                            'title': 'Pasta with Mushrooms',
                            'ingredients': {
                                'Pasta': {'quantity': 75, 'unit': 'g'},
                                'Mushrooms': {'quantity': 50, 'unit': 'g mushrooms'},
                                'Cherry tomatoes': {'quantity': 38, 'unit': 'g'},
                                'Coconut milk': {'quantity': 63, 'unit': 'ml (17-19%)'},
                                'Spinach': {'quantity': 13, 'unit': 'g'},
                                'Garlic': {'quantity': 0.3, 'unit': 'cloves'},
                                'Soy sauce': {'quantity': 7.5, 'unit': 'ml'},
                                'Olive oil': {'quantity': 5, 'unit': 'ml'},
                                'Salt': 'as desired',
                                'Black pepper': 'as desired',
                                'Herbs': 'as desired',

                                '\nCalories': {'quantity': 414, 'unit': 'kcal'}
                            },
                            'instructions': 'Chop all the ingredients. Bring water to boil. Cook the pasta until al '
                                            'dente. Leave the pan on medium heat. On vegetable oil saute the '
                                            'mushrooms for 3 to 4 minutes, stirring. Add the spinach and garlic to '
                                            'the mushrooms in the pan. Stir and saute everything together for another '
                                            '2 minutes. Add the cherry tomatoes to the pan and stir. Stir-fry for a '
                                            'couple more minutes. Add the soy sauce and pre-boiled pasta. Stir well '
                                            'and pour in the coconut milk. Stir thoroughly. Let simmer for 3 minutes '
                                            'on low heat.'
                        },
                        'lintil_cutlets': {
                            'title': 'Lentil Cutlets',
                            'ingredients': {
                                'Lentils': {'quantity': 30, 'unit': 'g red'},
                                'Onion': {'quantity': 30, 'unit': 'g'},
                                'Carrots': {'quantity': 23, 'unit': 'g'},
                                'Flour': {'quantity': 6, 'unit': 'g'},
                                'Hmeli-suneli': {'quantity': 0.2, 'unit': 'g'},
                                'Garlic': {'quantity': 0.4, 'unit': 'g dried'},
                                'Walnuts': {'quantity': 10, 'unit': 'g'},
                                'Herbs': {'quantity': 4, 'unit': 'g'},
                                'Vegetable oil': {'quantity': 6, 'unit': 'ml'},
                                'Salt': 'as desired',
                                'Black pepper': 'as desired',
                                'Water': {'quantity': 40, 'unit': 'ml'},

                                '\nCalories': {'quantity': 265, 'unit': 'kcal'}
                            },
                            'instructions': 'Peel and chop the onion. Fry onions in vegetable oil for 2-3 minutes '
                                            'over medium heat, stirring constantly. Peel and grate the carrots. Fry '
                                            'over medium heat for another 2-3 minutes, stirring. Rinse the red lentils '
                                            'several times with running water, rubbing the grains between your fingers '
                                            'to remove any dust. Add to the pan. Add salt, ground black pepper, '
                                            'hmeli-suneli, dried ground garlic. Stir all ingredients together. Add '
                                            'water and bring to a boil. Cover with a lid and cook the lentils over '
                                            'low heat until tender. Cool and chop with a blender. Add the flour and '
                                            'stir to combine. Chop the walnuts and add to the total mixture, add the '
                                            'herbs. Form cutlets and fry in vegetable oil.'
                        },
                        'ratatouille': {
                            'title': 'Ratatouille',
                            'ingredients': {
                                'Eggplant': {'quantity': 0.5, 'unit': 'piece'},
                                'Yellow sweet pepper': {'quantity': 0.5, 'unit': 'piece'},
                                'Red sweet pepper': {'quantity': 0.5, 'unit': 'piece'},
                                'Onion': {'quantity': 0.5, 'unit': 'head'},
                                'Garlic': {'quantity': 0.5, 'unit': 'clove'},
                                'Tomatoes': {'quantity': 0.5, 'unit': 'piece'},
                                'A pinch of sugar': '',
                                'Olive oil': {'quantity': 1.5, 'unit': 'teaspoons'},
                                'Tomato paste': 'as desired',
                                'Parsley': {'quantity': 2, 'unit': 'g'},
                                'Salt': 'as desired',
                                'Ground black pepper': 'as desired',

                                '\nCalories': {'quantity': 138, 'unit': 'kcal'}
                            },
                            'instructions': 'Finely chop the onions and eggplants. Sprinkle the eggplants with salt '
                                            'and let them soak for a few minutes. Peel the insides of the peppers and '
                                            'tomatoes and chop the flesh into the same small cubes as the eggplants '
                                            'and onions. Chop the garlic and parsley finely. Heat some of the olive '
                                            'oil in a pan, sauté the onions until soft and drain them in a colander. '
                                            'Add a little more oil to the pan and fry the eggplant cubes, which have '
                                            'been squeezed from excess liquid, until soft. Throw the fried eggplants '
                                            'on a colander. Now fry the pepper cubes in the same oil and throw them '
                                            'on a colander. Pour the remaining oil into the pan, fry garlic until '
                                            'soft, immediately add tomato paste and a pinch of sugar, and then '
                                            'immediately tomatoes. Stew for thirty seconds, then add all the '
                                            'previously fried vegetables and chopped parsley, salt, pepper, simmer for '
                                            'a minute and remove from the heat.'
                        },
                        'pasta_with_fresh_tomatoes': {
                            'title': 'Pasta with Fresh Tomatoes',
                            'ingredients': {
                                'Tagliatelle pasta': {'quantity': 100, 'unit': 'g'},
                                'Tomatoes': {'quantity': 0.5, 'unit': 'piece'},
                                'Seedless olives': {'quantity': 2.5, 'unit': 'pieces'},
                                'Garlic': {'quantity': 1, 'unit': 'clove'},
                                'Olive oil': {'quantity': 1.5, 'unit': 'tablespoons'},

                                '\nCalories': {'quantity': 532, 'unit': 'kcal'}
                            },
                            'instructions': 'Boil the pasta in salted boiling water. At the same time, lightly saute '
                                            'the garlic and sliced olives in 1 tablespoon of olive oil. Chop the '
                                            'fresh tomatoes into cubes and add them to the garlic and olives. The '
                                            'tomatoes do not need to be cooked, they should just be warmed through. '
                                            'Lightly salt and pepper the sauce. Drain the water and combine the pasta '
                                            'with the sauce. Place the pasta in a plate and sprinkle lightly with '
                                            'olive oil.'
                        }
                    }

                    for recipe_data in dictionary.values():
                        for ingredient_data in recipe_data['ingredients'].values():
                            if 'quantity_per_serving' in ingredient_data:
                                ingredient_data['quantity'] = ingredient_data['quantity_per_serving'] * servings

                    return dictionary
                case 'halal':
                    dictionary = {
                        'chicken_skewers_with_vegetables': {
                            'title': 'Halal Chicken Skewers with Vegetables',
                            'ingredients': {
                                'Chicken breast': {'quantity': 150, 'unit': 'g'},
                                'Bell pepper': {'quantity': 100, 'unit': 'g'},
                                'Cherry tomatoes': {'quantity': 100, 'unit': 'g'},
                                'Olive oil': {'quantity': 1, 'unit': 'tablespoon'},
                                'Dried thyme': {'quantity': 1, 'unit': 'teaspoon'},
                                'Salt': 'to taste',
                                'Pepper': 'to taste',

                                '\nCalories': {'quantity': 111, 'unit': 'kcal'}
                            },
                            'instructions': 'Cut the chicken breast and vegetables into small pieces. Mix them with '
                                            'olive oil, dried thyme, salt, and pepper. Thread the ingredients onto '
                                            'skewers and grill or cook in a grill pan until cooked through, '
                                            'about 15-20 minutes.'
                        },
                        'fried_fish_with_vegetables': {
                            'title': 'Fried Fish with Vegetables',
                            'ingredients': {
                                'White fish (cod, haddock or hake)': {'quantity': 150, 'unit': 'g'},
                                'Broccoli': {'quantity': 100, 'unit': 'g'},
                                'Carrots': {'quantity': 50, 'unit': 'g'},
                                'Olive oil': {'quantity': 1, 'unit': 'tablespoon'},
                                'Lemon juice': {'quantity': 1, 'unit': 'teaspoon'},
                                'Salt': 'to taste',
                                'Pepper': 'to taste',

                                '\nCalories': {'quantity': 93, 'unit': 'kcal'}
                            },
                            'instructions': 'Cut the fish into portion-sized pieces. Fry the fish in olive oil until '
                                            'golden brown, about 5-7 minutes on each side. Add the chopped broccoli '
                                            'and carrots, and cook for another 5-7 minutes until the vegetables are '
                                            'tender. Drizzle the dish with lemon juice, and season with salt and '
                                            'pepper to taste.'
                        },
                        'chicken_with_rice_and_vegetables': {
                            'title': 'Chicken with Rice and Vegetables',
                            'ingredients': {
                                'Chicken breast': {'quantity': 150, 'unit': 'g'},
                                'Rice': {'quantity': 100, 'unit': 'g'},
                                'Broccoli': {'quantity': 50, 'unit': 'g'},
                                'Carrots': {'quantity': 50, 'unit': 'g'},
                                'Olive oil': {'quantity': 1, 'unit': 'tablespoon'},
                                'Salt': 'to taste',
                                'Pepper': 'to taste',

                                '\nCalories': {'quantity': 118, 'unit': 'kcal'}
                            },
                            'instructions': 'Cook the rice according to the package instructions. Chop the chicken '
                                            'breast. Sauté the chicken in olive oil until golden brown, about 7-10 '
                                            'minutes. Add the chopped broccoli and carrots, and cook for another 5-7 '
                                            'minutes until the vegetables are tender. Combine the chicken with the '
                                            'rice, and season with salt and pepper to taste.'
                        },
                        'basbousa': {
                            'title': 'Basbousa (Sweet Semolina Cake)',
                            'ingredients': {
                                'Semolina': {'quantity': 50, 'unit': 'g'},
                                'Coconut flakes': {'quantity': 10, 'unit': 'g'},
                                'Flour': {'quantity': 20, 'unit': 'g'},
                                'Sugar': {'quantity': 15, 'unit': 'g'},
                                'Baking powder': {'quantity': 0.5, 'unit': 'teaspoon'},
                                'Yogurt': {'quantity': 50, 'unit': 'g'},
                                'Vegetable oil': {'quantity': 1, 'unit': 'tablespoon'},
                                'Egg': {'quantity': 1, 'unit': 'piece'},
                                'Sugar(for syrup': {'quantity': 2, 'unit': 'tablespoons'},
                                'Water': {'quantity': 2, 'unit': 'tablespoons'},
                                'Lemon juice': {'quantity': 1, 'unit': 'teaspoon'},
                                'Vanilla': 'a pinch',

                                '\nCalories': {'quantity': 232, 'unit': 'kcal'}
                            },
                            'instructions': 'Mix the dry ingredients, then add the yogurt, oil, and egg, and knead '
                                            'the dough. Bake the cake for 20-25 minutes, then soak it in the syrup '
                                            'made with sugar, water, lemon juice, and vanilla.'
                        },
                        'maqlooba': {
                            'title': 'Maqlooba (Upside-down Rice Dish)',
                            'ingredients': {
                                'Lamb or chicken': {'quantity': 150, 'unit': 'g'},
                                'Rice': {'quantity': 100, 'unit': 'g'},
                                'Onion': {'quantity': 1, 'unit': 'medium'},
                                'Tomatoes': {'quantity': 2, 'unit': 'medium'},
                                'Eggplant': {'quantity': 1, 'unit': 'medium'},
                                'Vegetable oil': {'quantity': 2, 'unit': 'tablespoons'},
                                'Maqlooba spice mix (cumin, cinnamon, black pepper)': {'quantity': 1,
                                                                                       'unit': 'teaspoon'},
                                'Salt': 'to taste',

                                '\nCalories': {'quantity': 146, 'unit': 'kcal'}
                            },
                            'instructions': 'Heat the vegetable oil in a deep pan or pot. Sauté the meat until '
                                            'browned, then add the onion and cook until translucent. Add the '
                                            'tomatoes, eggplant, spices, and salt. Mix and simmer for 5-7 minutes. '
                                            'Add the rice, mix well, and cook for another 5 minutes. Cover the '
                                            'skillet and simmer on low heat for 20-25 minutes until the rice is '
                                            'cooked. Invert the maqlooba onto a serving dish and serve.'
                        }
                    }

                    for recipe_data in dictionary.values():
                        for ingredient_data in recipe_data['ingredients'].values():
                            if 'quantity_per_serving' in ingredient_data:
                                ingredient_data['quantity'] = ingredient_data['quantity_per_serving'] * servings

                    return dictionary

                case 'regular':
                    dictionary = {
                        'chicken_with_rice_and_vegetables': {
                            'title': 'Chicken Breast with Rice and Vegetables',
                            'ingredients': {
                                'Chicken Breast': {'quantity': 150, 'unit': 'g'},
                                'Rice': {'quantity': 100, 'unit': 'g'},
                                'Broccoli': {'quantity': 50, 'unit': 'g'},
                                'Carrots': {'quantity': 50, 'unit': 'g'},
                                'Olive Oil': {'quantity': 1, 'unit': 'tablespoon'},
                                'Salt': 'to taste',
                                'Pepper': 'to taste',

                                '\nCalories': {'quantity': 433, 'unit': 'kcal'}
                            },
                            'instructions': 'Cook the rice according to the package instructions. Cut the chicken '
                                            'breast into small pieces. Sauté the chicken in olive oil until golden '
                                            'brown, about 7-10 minutes. Add the chopped broccoli and carrots, '
                                            'and cook for another 5-7 minutes until the vegetables are tender. '
                                            'Combine the chicken with the rice, and season with salt and pepper to '
                                            'taste.'
                        },
                        'spaghetti_with_meatballs': {
                            'title': 'Spaghetti with Meatballs',
                            'ingredients': {
                                'Spaghetti': {'quantity': 100, 'unit': 'g'},
                                'Ground Meat (beef/pork)': {'quantity': 80, 'unit': 'g'},
                                'Egg': {'quantity': 1, 'unit': 'piece'},
                                'Breadcrumbs': {'quantity': 2, 'unit': 'tablespoons'},
                                'Grated Parmesan': {'quantity': 1, 'unit': 'tablespoon'},
                                'Olive Oil': {'quantity': 1, 'unit': 'tablespoon'},
                                'Garlic': {'quantity': 1, 'unit': 'clove'},
                                'Tomato Sauce': {'quantity': 400, 'unit': 'g'},
                                'Salt': 'to taste',
                                'Pepper': 'to taste',

                                '\nCalories': {'quantity': 450, 'unit': 'kcal'}
                            },
                            'instructions': 'Cook the spaghetti according to the package instructions. Mix the ground '
                                            'meat, egg, breadcrumbs, Parmesan, salt, and pepper. Form small '
                                            'meatballs. Fry the meatballs in olive oil until golden brown. Add minced '
                                            'garlic and tomato sauce, and simmer for 10-15 minutes. Serve spaghetti '
                                            'with meatballs and sauce.'
                        },
                        'lasagna': {
                            'title': 'Lasagna',
                            'ingredients': {
                                'Lasagna Sheets': {'quantity': 100, 'unit': 'g'},
                                'Ground Meat (beef/pork)': {'quantity': 100, 'unit': 'g'},
                                'Olive Oil': {'quantity': 1, 'unit': 'tablespoon'},
                                'Onion': {'quantity': 1, 'unit': 'piece'},
                                'Garlic': {'quantity': 2, 'unit': 'cloves'},
                                'Tomato Sauce': {'quantity': 400, 'unit': 'g'},
                                'Mozzarella Cheese': {'quantity': 100, 'unit': 'g'},
                                'Grated Parmesan': {'quantity': 30, 'unit': 'g'},
                                'Salt': 'to taste',
                                'Pepper': 'to taste',

                                '\nCalories': {'quantity': 550, 'unit': 'kcal'}
                            },
                            'instructions': 'Sauté the ground meat in olive oil until cooked, then add chopped onion '
                                            'and garlic. Add tomato sauce, salt, and pepper, and simmer for 10-15 '
                                            'minutes. Layer lasagna sheets, meat sauce, mozzarella, and Parmesan. '
                                            'Repeat layers, topping with a final layer of lasagna sheets. Bake in the '
                                            'oven at 180°C for 30-40 minutes.'
                        },
                        'baked_fish_with_potatoes': {
                            'title': 'Baked Fish with Potatoes',
                            'ingredients': {
                                'White Fish (cod, haddock or hake)': {'quantity': 150, 'unit': 'g'},
                                'Potatoes': {'quantity': 200, 'unit': 'g'},
                                'Olive Oil': {'quantity': 1, 'unit': 'tablespoon'},
                                'Lemon Juice': {'quantity': 1, 'unit': 'teaspoon'},
                                'Chopped Dill': {'quantity': 1, 'unit': 'teaspoon'},
                                'Salt': 'to taste',
                                'Pepper': 'to taste',

                                '\nCalories': {'quantity': 210, 'unit': 'kcal'}
                            },
                            'instructions': 'Slice the potatoes and arrange them on a baking sheet greased with oil. '
                                            'Place the fish on top, drizzle with lemon juice, and sprinkle with dill, '
                                            'salt, and pepper. Bake in the oven at 200°C for 20-25 minutes until the '
                                            'fish is cooked.'
                        },
                        'chicken_noodle_soup': {
                            'title': 'Chicken Noodle Soup',
                            'ingredients': {
                                'Chicken Broth': {'quantity': 200, 'unit': 'ml'},
                                'Noodles': {'quantity': 50, 'unit': 'g'},
                                'Chicken Breast': {'quantity': 50, 'unit': 'g'},
                                'Carrots': {'quantity': 50, 'unit': 'g'},
                                'Leeks': {'quantity': 50, 'unit': 'g'},
                                'Green Onions': {'quantity': 1, 'unit': 'stalk'},
                                'Salt': 'to taste',
                                'Pepper': 'to taste',

                                '\nCalories': {'quantity': 150, 'unit': 'kcal'}

                            },
                            'instructions': 'Bring the chicken broth to a boil, add the noodles, and cook for 5-7 '
                                            'minutes. Add sliced chicken breast, carrots, and leeks, and cook for '
                                            'another 5-7 minutes. Season with salt and pepper, and add green onions.'
                        }
                    }

                    for recipe_data in dictionary.values():
                        for ingredient_data in recipe_data['ingredients'].values():
                            if 'quantity_per_serving' in ingredient_data:
                                ingredient_data['quantity'] = ingredient_data['quantity_per_serving'] * servings

                    return dictionary
